coocox/cox/Holtek/HT32F125x/resource/holtek_coide_empty_project/cmsis_boot/ht32f125x.h
/**************************************************************************//**
 * @file    ht32f125x.h
 * @brief   CMSIS Cortex-M3 Device Peripheral Access Layer Header File
 * @version V1.00
 * @date    04/11/2011
 *
 * @note
 * Copyright (C) 2011 Holtek Semiconductor Inc. All rights reserved.
 *
 * @par
 * ARM Limited (ARM) is supplying this software for use with Cortex-M
 * processor based microcontrollers.  This file can be freely distributed
 * within development tools that are supporting such ARM based processors.
 *
 * @par
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************/

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup HT32F125x
  * @{
  */

#ifndef __HT32F125x_H__
#define __HT32F125x_H__

#if (HT32F_LIB_DEBUG == 1)
  #warning "Library debug mode is enabled."
  #warning "Remember to disable it after debug operation finished."
#endif

#ifdef __cplusplus
 extern "C" {
#endif

/** @addtogroup Library_configuration_section
  * @{
  */

#define HSI_VALUE         8000000UL  /*!< Value of the Internal oscillator in Hz */

/**
 * @brief In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.
  */
#if !defined  HSE_VALUE
  /* Avaiable HSE_VALUE: 4MHz ~ 16MHz */
  #define HSE_VALUE       8000000UL   /*!< Value of the External oscillator in Hz */
#endif


/**
 * @brief In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value
   */
#define HSE_READY_TIME    ((uint16_t)0xFFFF)    /*!< Time out for HSE start up */




/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
#define __MPU_PRESENT             0    /*!< MPU present or not               */
#define __NVIC_PRIO_BITS          4    /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0    /*!< Set to 1 if different SysTick Config is used */

/**
  * @}
  */


/** @addtogroup Configuration_for_Inetrrupt_Number
  * @{
  */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers *******************************/
  NonMaskableInt_IRQn     = -14,    /*!< 2 Non Maskable Interrupt             */
  HardFault_IRQn          = -13,    /*!< 3 Cortex-M3 Hard Fault Interrupt     */
  MemoryManagement_IRQn   = -12,    /*!< 4 Cortex-M3 Memory Management Int    */
  BusFault_IRQn           = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt      */
  UsageFault_IRQn         = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt    */
  SVCall_IRQn             = -5,     /*!< 11 Cortex-M3 SV Call Interrupt       */
  DebugMonitor_IRQn       = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt */
  PendSV_IRQn             = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt       */
  SysTick_IRQn            = -1,     /*!< 15 Cortex-M3 System Tick Interrupt   */

/******  HT32F Specific Interrupt Numbers *************************************/
  CKRDY_IRQn              = 0,      /*!< Clock ready interrupt                */
  LVD_IRQn                = 1,      /*!< Low voltage detection interrupt      */
  BOD_IRQn                = 2,      /*!< Brown-Out detection interrupt        */
  WDT_IRQn                = 3,      /*!< WDT global interrupt                 */
  RTC_IRQn                = 4,      /*!< RTC Wake-up Interrupt                */
  FLASH_IRQn              = 5,      /*!< FLASH global Interrupt               */
  EVWUP_IRQn              = 6,      /*!< Event Wake-up Interrupt              */
  LPWUP_IRQn              = 7,      /*!< WAKEUP pin Interrupt                 */
  EXTI0_IRQn              = 8,      /*!< EXTI0 Line detection Interrupt       */
  EXTI1_IRQn              = 9,      /*!< EXTI1 Line detection Interrupt       */
  EXTI2_IRQn              = 10,     /*!< EXTI2 Line detection Interrupt       */
  EXTI3_IRQn              = 11,     /*!< EXTI3 Line detection Interrupt       */
  EXTI4_IRQn              = 12,     /*!< EXTI4 Line detection Interrupt       */
  EXTI5_IRQn              = 13,     /*!< EXTI5 Line detection Interrupt       */
  EXTI6_IRQn              = 14,     /*!< EXTI6 Line detection Interrupt       */
  EXTI7_IRQn              = 15,     /*!< EXTI7 Line detection Interrupt       */
  EXTI8_IRQn              = 16,     /*!< EXTI8 Line detection Interrupt       */
  EXTI9_IRQn              = 17,     /*!< EXTI9 Line detection Interrupt       */
  EXTI10_IRQn             = 18,     /*!< EXTI10 Line detection Interrupt      */
  EXTI11_IRQn             = 19,     /*!< EXTI11 Line detection Interrupt      */
  EXTI12_IRQn             = 20,     /*!< EXTI12 Line detection Interrupt      */
  EXTI13_IRQn             = 21,     /*!< EXTI13 Line detection Interrupt      */
  EXTI14_IRQn             = 22,     /*!< EXTI14 Line detection Interrupt      */
  EXTI15_IRQn             = 23,     /*!< EXTI15 Line detection Interrupt      */
  COMP_IRQn               = 24,     /*!< Comparator global Interrupt          */
  ADC_IRQn                = 25,     /*!< ADC Interrupt                        */
  GPTM0_IRQn              = 35,     /*!< General-Purpose Timer0 Interrupt     */
  GPTM1_IRQn              = 36,     /*!< General-Purpose Timer1 Interrupt     */
  I2C_IRQn                = 43,     /*!< I2C global Interrupt                 */
  SPI_IRQn                = 45,     /*!< SPI global Interrupt                 */
  USART_IRQn              = 47      /*!< USART global Interrupt               */
} IRQn_Type;


/**
  * @}
  */

#include "core_cm3.h"                  /* Cortex-M3 processor and core periphs  */
#include "system_ht32f125x.h"          /* HT32F system                    */


