coocox/cox/Holtek/HT32F125x/resource/holtek_coide_empty_project/cmsis_boot/ht32f125x.h
/** @addtogroup Exported_Types
  * @{
  */

typedef signed long  s32;
typedef signed short s16;
typedef signed char  s8;

typedef const int32_t sc32;   /*!< Read Only */
typedef const int16_t sc16;   /*!< Read Only */
typedef const int8_t  sc8;    /*!< Read Only */

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t  vs8;

typedef __I int32_t vsc32;    /*!< Read Only */
typedef __I int16_t vsc16;    /*!< Read Only */
typedef __I int8_t  vsc8;     /*!< Read Only */

typedef unsigned long  u32;
typedef unsigned short u16;
typedef unsigned char  u8;

typedef unsigned long  const uc32;    /*!< Read Only */
typedef unsigned short const uc16;    /*!< Read Only */
typedef unsigned char  const uc8;     /*!< Read Only */

typedef __IO uint32_t  vu32;
typedef __IO uint16_t  vu16;
typedef __IO uint8_t   vu8;

typedef __I uint32_t vuc32;   /*!< Read Only */
typedef __I uint16_t vuc16;   /*!< Read Only */
typedef __I uint8_t vuc8;     /*!< Read Only */


typedef enum {DISABLE = 0, ENABLE = !DISABLE} EventStatus, ControlStatus;
#define IS_CONTROL_STATUS(STATUS) ((STATUS == DISABLE) || (STATUS == ENABLE))

typedef enum {FALSE = 0, TRUE = !FALSE} bool;

typedef enum {RESET = 0, SET = !RESET} FlagStatus;

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrStatus;

/**
  * @}
  */

#if defined (__CC_ARM)
  #define __ALIGN4 __align(4)
#elif defined (__ICCARM__)
  #define __ALIGN4 _Pragma("data_alignment = 4")
#elif defined (__GNUC__)
  #define __ALIGN4  __attribute__((aligned(4)))
#endif

#if defined (__GNUC__)
  #define __PACKED_H
  #define __PACKED_F __attribute__ ((packed))
#elif defined (__ICCARM__) || (__CC_ARM)
  #define __PACKED_H __packed
  #define __PACKED_F
#endif


#define U8_MAX     ((u8)255)
#define S8_MAX     ((s8)127)
#define S8_MIN     ((s8)-128)
#define U16_MAX    ((u16)65535u)
#define S16_MAX    ((s16)32767)
#define S16_MIN    ((s16)-32768)
#define U32_MAX    ((u32)4294967295uL)
#define S32_MAX    ((s32)2147483647)
#define S32_MIN    ((s32)-2147483648)


/**
 * @brief Exported constants and macro
 */
#define wb(addr, value)     (*((u8  volatile *) (addr)) = value)
#define rb(addr)            (*((u8  volatile *) (addr)))
#define whw(addr, value)    (*((u16 volatile *) (addr)) = value)
#define rhw(addr)           (*((u16 volatile *) (addr)))
#define ww(addr, value)     (*((u32 volatile *) (addr)) = value)
#define rw(addr)            (*((u32 volatile *) (addr)))


#define ResetBit_BB(Addr, BitNumber) (*(vu32 *) ((Addr & 0xF0000000) + 0x02000000 + \
                                      ((Addr & 0xFFFFF) << 5) + (BitNumber << 2)) = 0)
#define SetBit_BB(Addr, BitNumber)   (*(vu32 *) ((Addr & 0xF0000000) + 0x02000000 + \
                                      ((Addr & 0xFFFFF) << 5) + (BitNumber << 2)) = 1)
#define GetBit_BB(Addr, BitNumber)   (*(vu32 *) ((Addr & 0xF0000000) + 0x02000000 + \
                                      ((Addr & 0xFFFFF) << 5) + (BitNumber << 2)))
#define BitBand(Addr, BitNumber)     (*(vu32 *) ((Addr & 0xF0000000) + 0x02000000 + \
                                     ((Addr & 0xFFFFF) << 5) + (BitNumber << 2)))


#ifndef EXT
  #define EXT extern
#endif

/** @addtogroup Peripheral_Registers_Structures
  * @{
  */


/**
 * @brief Universal Synchronous Asynchronous Receiver Transmitter
 */
typedef struct
{
  __IO uint32_t RBR;             /*!< 0x000         Receive Buffer Register/Transmit Holding Register                */
  __IO uint32_t IER;             /*!< 0x004         Interrupt Enable Register                                        */
  __IO uint32_t IIR;             /*!< 0x008         Interrupt Identification Register/FIFO Control Register          */
  __IO uint32_t FCR;             /*!< 0x00C         FIFO Control Register                                            */
  __IO uint32_t LCR;             /*!< 0x010         Line Control Register                                            */
  __IO uint32_t MCR;             /*!< 0x014         Modem Control Register                                           */
  __IO uint32_t LSR;             /*!< 0x018         Line Status Register                                             */
  __IO uint32_t MSR;             /*!< 0x01C         Modem Status Register                                            */
  __IO uint32_t TPR;             /*!< 0x020         Timing Parameter Register                                        */
  __IO uint32_t MDR;             /*!< 0x024         Mode Register                                                    */
  __IO uint32_t ICR;             /*!< 0x028         IrDA Register                                                    */
  __IO uint32_t RCR;             /*!< 0x02C         RS485 Control Register                                           */
  __IO uint32_t SCR;             /*!< 0x030         Synchronous Control Register                                     */
  __IO uint32_t DTR;             /*!< 0x034         Debug/Test Register                                              */
  __IO uint32_t DLR;             /*!< 0x038         Divisor Latch Register                                           */
} USART_TypeDef;


/**
 * @brief SPI
 */
typedef struct
{
  __IO uint32_t CR0;             /*!< 0x000         Control Register 0                                               */
  __IO uint32_t CR1;             /*!< 0x004         Control Register 1                                               */
  __IO uint32_t IER;             /*!< 0x008         Interrupt Enable Register                                        */
  __IO uint32_t CPR;             /*!< 0x00C         Clock Prescale Register                                          */
  __IO uint32_t DR;              /*!< 0x010         Data Register                                                    */
  __IO uint32_t SR;              /*!< 0x014         Status Register                                                  */
  __IO uint32_t FCR;             /*!< 0x018         FIFO Control Register                                            */
  __IO uint32_t FSR;             /*!< 0x01C         FIFO Status Register                                             */
  __IO uint32_t FTOCR;           /*!< 0x020         FIFO Time Out Conuter Register                                   */
} SPI_TypeDef;


/**
 * @brief Analog to Digital Converter
 */
typedef struct
{
       uint32_t RESERVE0[1];     /*!< 0x000         Reserved                                                         */
  __IO uint32_t RST;             /*!< 0x004         ADC Reset Register                                               */
  __IO uint32_t CONV;            /*!< 0x008         ADC (Regular) Conversion Mode Register                           */
  __IO uint32_t HCONV;           /*!< 0x00C         ADC High-priority Conversion Mode Register                       */
  __IO uint32_t LST[4];          /*!< 0x010 - 0x01C ADC (Regular) Conversion List Register 0-3                       */
  __IO uint32_t HLST;            /*!< 0x020         ADC High-priority Conversion List Register                       */
       uint32_t RESERVE1[3];     /*!< 0x024 - 0x02C Reserved                                                         */
       uint32_t RESERVE2[8];     /*!< 0x030 - 0x04C Reserved                                                         */
       uint32_t RESERVE3[8];     /*!< 0x050 - 0x06C Reserved                                                         */
  __IO uint32_t STR[8];          /*!< 0x070 - 0x08C ADC Input 0 Sampling Time Register                               */
       uint32_t RESERVE4[8];     /*!< 0x090 - 0x0AC Reserved                                                         */
  __IO uint32_t DR[16];          /*!< 0x0B0 - 0x0EC ADC (Regular) Conversion Data Register 0                         */
  __IO uint32_t HDR[4];          /*!< 0x0F0 - 0x0FC ADC High-Priority Conversion Data Register 0                     */
  __IO uint32_t TCR;             /*!< 0x100         ADC (Regular) Trigger Control Register                           */
  __IO uint32_t TSR;             /*!< 0x104         ADC (Regular) Trigger Source Register                            */
       uint32_t RESERVE5[2];     /*!< 0x108 - 0x10C Reserved                                                         */
  __IO uint32_t HTCR;            /*!< 0x110         ADC High-Priority Trigger Control Register                       */
  __IO uint32_t HTSR;            /*!< 0x114         ADC High-Priority Trigger Source Register                        */
       uint32_t RESERVE6[2];     /*!< 0x118 - 0x11C Reserved                                                         */
  __IO uint32_t WCR;             /*!< 0x120         ADC Watchdog Control Register                                    */
  __IO uint32_t LTR;             /*!< 0x124         ADC Lower Threshold Register                                     */
  __IO uint32_t UTR;             /*!< 0x128         ADC Upper Threshold Register                                     */
       uint32_t RESERVE7[1];     /*!< 0x12C         Reserved                                                         */
  __IO uint32_t IM;              /*!< 0x130         ADC interrupt mask enable register                               */
  __IO uint32_t IRAW;            /*!< 0x134         ADC raw interrupt status register                                */
  __IO uint32_t IMASK;           /*!< 0x138         ADC interrupt masked status register                             */
  __IO uint32_t ICLR;            /*!< 0x13C         ADC interrupt clear register                                     */
       uint32_t RESERVE8[1];     /*!< 0x140         Reserved                                                         */
} ADC_TypeDef;


/**
 * @brief Op Amp/Comparator
 */
typedef struct
{
  __IO uint32_t OPAC;           /*!< 0x000         Operational Amplifier control register                           */
  __IO uint32_t OFVC;           /*!< 0x004         Comparator control register                                      */
  __IO uint32_t CMPIM;          /*!< 0x008         Comparator interrupt mask enable                                 */
  __IO uint32_t CMPIRAW;        /*!< 0x00C         Comparator raw interrupt status                                  */
  __IO uint32_t CMPIMASK;       /*!< 0x010         Comparator masked interrupt status                               */
  __IO uint32_t CMPICLR;        /*!< 0x014         Comparator interrupt clear register                              */
} CMP_OP_TypeDef;


/**
 * @brief General Purpose I/O
 */
typedef struct
{
  __IO uint32_t DIRCR;          /*!< 0x000         Data Direction Control Register                                  */
  __IO uint32_t INER;           /*!< 0x004         Input function enable register                                   */
  __IO uint32_t PUR;            /*!< 0x008         Pull-Up Selection Register                                       */
  __IO uint32_t PDR;            /*!< 0x00C         Pull-Down Selection Register                                     */
  __IO uint32_t ODR;            /*!< 0x010         Open Drain Selection Register                                    */
  __IO uint32_t DRVR;           /*!< 0x014         Drive Current Selection Register                                 */
  __IO uint32_t LOCKR;          /*!< 0x018         Lock Register                                                    */
  __IO uint32_t DINR;           /*!< 0x01c         Data Input Register                                              */
  __IO uint32_t DOTR;           /*!< 0x020         Data Output Register                                             */
  __IO uint32_t SRR;            /*!< 0x024         Output Set and Reset Control Register                            */
  __IO uint32_t RR;             /*!< 0x028         Output Reset Control Register                                    */
} GPIO_TypeDef;


/**
 * @brief AFIO
 */
typedef struct
{
  __IO uint32_t ESSR[2];        /*!< 0x000         EXTI Source Selection Register 0 ~ 1                             */
  __IO uint32_t GPACFGR;        /*!< 0x008         GPIO A Configuration Register                                    */
  __IO uint32_t GPBCFGR;        /*!< 0x00C         GPIO B Configuration Register                                    */
} AFIO_TypeDef;


/**
 * @brief External Interrupt/Event Controller
 */
typedef struct
{
  __IO uint32_t CFGR0;           /*!< 0x000         EXTI Interrupt 0 Configuration Register                          */
  __IO uint32_t CFGR1;           /*!< 0x000         EXTI Interrupt 1 Configuration Register                          */
  __IO uint32_t CFGR2;           /*!< 0x000         EXTI Interrupt 2 Configuration Register                          */
  __IO uint32_t CFGR3;           /*!< 0x000         EXTI Interrupt 3 Configuration Register                          */
  __IO uint32_t CFGR4;           /*!< 0x000         EXTI Interrupt 4 Configuration Register                          */
  __IO uint32_t CFGR5;           /*!< 0x000         EXTI Interrupt 5 Configuration Register                          */
  __IO uint32_t CFGR6;           /*!< 0x000         EXTI Interrupt 6 Configuration Register                          */
  __IO uint32_t CFGR7;           /*!< 0x000         EXTI Interrupt 7 Configuration Register                          */
  __IO uint32_t CFGR8;           /*!< 0x000         EXTI Interrupt 8 Configuration Register                          */
  __IO uint32_t CFGR9;           /*!< 0x000         EXTI Interrupt 9 Configuration Register                          */
  __IO uint32_t CFGR10;          /*!< 0x000         EXTI Interrupt 10 Configuration Register                         */
  __IO uint32_t CFGR11;          /*!< 0x000         EXTI Interrupt 11 Configuration Register                         */
  __IO uint32_t CFGR12;          /*!< 0x000         EXTI Interrupt 12 Configuration Register                         */
  __IO uint32_t CFGR13;          /*!< 0x000         EXTI Interrupt 13 Configuration Register                         */
  __IO uint32_t CFGR14;          /*!< 0x000         EXTI Interrupt 14 Configuration Register                         */
  __IO uint32_t CFGR15;          /*!< 0x000         EXTI Interrupt 15 Configuration Register                         */
  __IO uint32_t CR;              /*!< 0x040         EXTI Interrupt Control Register                                  */
  __IO uint32_t EDGEFLGR;        /*!< 0x044         EXTI Interrupt Edge Flag Register                                */
  __IO uint32_t EDGESR;          /*!< 0x048         EXTI Interrupt Edge Status Register                              */
  __IO uint32_t SCR;             /*!< 0x04C         EXTI Interrupt Software Command Register                         */
  __IO uint32_t WAKUPCR;         /*!< 0x050         EXTI Interrupt Wakeup Control Register                           */
  __IO uint32_t WAKUPPOLR;       /*!< 0x054         EXTI Interrupt Wakeup Polarity Register                          */
  __IO uint32_t WAKUPFLG;        /*!< 0x058         EXTI Interrupt Wakeup Flag Register                              */
} EXTI_TypeDef;


/**
 * @brief Inter-integrated Circuit Interface
 */
typedef struct
{
  __IO uint32_t CR;              /*!< 0x000         Control Register                                                 */
  __IO uint32_t IER;             /*!< 0x004         Interrupt Enable Register                                        */
  __IO uint32_t ADDR;            /*!< 0x008         Address Register                                                 */
  __IO uint32_t SR;              /*!< 0x00C         Status Register                                                  */
  __IO uint32_t SHPGR;           /*!< 0x010         SCL High Period Generation Register                              */
  __IO uint32_t SLPGR;           /*!< 0x014         SCL Low Period Generation Register                               */
  __IO uint32_t DR;              /*!< 0x018         Data Register                                                    */
  __IO uint32_t TAR;             /*!< 0x01C         Target Register                                                  */
} I2C_TypeDef;


/**
 * @brief WATCHDOG
 */
typedef struct
{
  __IO uint32_t CR;              /*!< 0x000         Control Register                                                 */
  __IO uint32_t MR0;             /*!< 0x004         Mode 0 Register                                                  */
  __IO uint32_t MR1;             /*!< 0x008         Mode 1 Register                                                  */
  __IO uint32_t SR;              /*!< 0x00C         Status Register                                                  */
  __IO uint32_t PR;              /*!< 0x010         WDT Write Protect Register                                       */
} WDT_TypeDef;


/**
 * @brief Real-Time Clock
 */
typedef struct
{
  __IO uint32_t CNT;             /*!< 0x000         RTC Counter Rgister                                              */
  __IO uint32_t CMP;             /*!< 0x004         RTC Compare Rgister                                              */
  __IO uint32_t CR;              /*!< 0x008         RTC Control Rgister                                              */
  __IO uint32_t SR;              /*!< 0x00C         RTC Status Register                                              */
  __IO uint32_t IWEN;            /*!< 0x010         RTC Interrup/Wake-up Enable Register                             */
} RTC_TypeDef;


/**
 * @brief Power Control Unit
 */
typedef struct
{
  __IO uint32_t BAKSR;           /*!< 0x000         Backup Domain Status Register                                    */
  __IO uint32_t BAKCR;           /*!< 0x004         Backup Domain Control Register                                   */
  __IO uint32_t BAKTEST;         /*!< 0x008         Backup Domain Test Register                                      */
       uint32_t HSIRCR;          /*!< 0x00C         HSI Ready Counter Control Register                               */
  __IO uint32_t LVDCSR;          /*!< 0x010         Low Voltage/Brown Out Detect Control and Status Register         */
       uint32_t RESERVE2[59];    /*!< 0x014 ~ 0x0FC Reserved                                                         */
  __IO uint32_t BAKREG[10];      /*!< 0x100 ~ 0x124 Backup Register 0 ~ 9                                            */
} PWRCU_TypeDef;


/**
 * @brief General-Purpose Timer
 */
typedef struct
{
  __IO uint32_t CNTCFR;          /*!< 0x000          Counter Configuration Register                                  */
  __IO uint32_t MDCFR;           /*!< 0x004          Mode Configuration Register                                     */
  __IO uint32_t TRCFR;           /*!< 0x008          Trigger Configuration Register                                  */
       uint32_t REV0;            /*!< 0x00C                                                                          */
  __IO uint32_t CTR;             /*!< 0x010          Control Register                                                */
       uint32_t RESERVED1[3];    /*!< 0x014 - 0x01C  Reserved                                                        */
  __IO uint32_t CH0ICFR;         /*!< 0x020          Channel-0 Input Configuration Register                          */
  __IO uint32_t CH1ICFR;         /*!< 0x024          Channel-1 Input Configuration Register                          */
  __IO uint32_t CH2ICFR;         /*!< 0x028          Channel-2 Input Configuration Register                          */
  __IO uint32_t CH3ICFR;         /*!< 0x02C          Channel-3 Input Configuration Register                          */
  __IO uint32_t RESERVED2[4];    /*!< 0x030 - 0x03C  Reserved                                                        */
  __IO uint32_t CH0OCFR;         /*!< 0x040          Channel-0 Output Configuration Register                         */
  __IO uint32_t CH1OCFR;         /*!< 0x044          Channel-1 Output Configuration Register                         */
  __IO uint32_t CH2OCFR;         /*!< 0x048          Channel-2 Output Configuration Register                         */
  __IO uint32_t CH3OCFR;         /*!< 0x04C          Channel-3 Output Configuration Register                         */
  __IO uint32_t CHCTR;           /*!< 0x050          Channel Control Register                                        */
  __IO uint32_t CHPOLR;          /*!< 0x054          Channel Polarity Configuration Register                         */
  __IO uint32_t RESERVED3[7];    /*!< 0x058 - 0x073  Reserved                                                        */
  __IO uint32_t ICTR;            /*!< 0x074          Interrupt Control Register                                      */
  __IO uint32_t EVGR;            /*!< 0x078          Software Interrupt Control Register                             */
  __IO uint32_t INTSR;           /*!< 0x07C          Interrupt Status Register                                       */
  __IO uint32_t CNTR;            /*!< 0x080          Counter Register                                                */
  __IO uint32_t PSCR;            /*!< 0x084          Prescaler Register                                              */
  __IO uint32_t CRR;             /*!< 0x088          Counter Reload Register                                         */
       uint32_t RESERVED4;       /*!< 0x08C          Reserved                                                        */
  __IO uint32_t CH0CCR;          /*!< 0x090          Channel 0 Capture/Compare Register                              */
  __IO uint32_t CH1CCR;          /*!< 0x094          Channel 1 Capture/Compare Register                              */
  __IO uint32_t CH2CCR;          /*!< 0x098          Channel 2 Capture/Compare Register                              */
  __IO uint32_t CH3CCR;          /*!< 0x09C          Channel 3 Capture/Compare Register                              */
} GPTM_TypeDef;


/**
 * @brief Flash Memory Controller
 */
typedef struct
{
  __IO uint32_t TADR;            /*!< 0x000         Flash Target Address Register                                    */
  __IO uint32_t WRDR;            /*!< 0x004         Flash Write Data Register                                        */
       uint32_t RESERVED0;       /*!< 0x008         Reserved                                                         */
  __IO uint32_t OCMR;            /*!< 0x00C         Flash Operation Command Register                                 */
  __IO uint32_t OPCR;            /*!< 0x010         Flash Operation Control Register                                 */
  __IO uint32_t OIER;            /*!< 0x014         Flash Operation Interrupt Enable Register                        */
  __IO uint32_t OISR;            /*!< 0x018         Flash Operation Interrupt and Status Register                    */
       uint32_t RESERVED1;       /*!< 0x01C         Reserved                                                         */
  __IO uint32_t PPSR[4];         /*!< 0x020 ~ 0x02C Flash Page Erase/Program Protection Status Register              */
  __IO uint32_t CPSR;            /*!< 0x030         Flash Security Protection Status Register                        */
       uint32_t RESERVED2[51];   /*!< 0x034 ~ 0x0FF Reserved                                                         */

