coocox/cox/Holtek/HT32F125x/resource/holtek_coide_empty_project/cmsis_boot/ht32f125x.h
  __IO uint32_t VMCR;            /*!< 0x100         Flash Vector Mapping Control Register                            */
       uint32_t RESERVED3[63];   /*!< 0x104 ~ 0x1FF Reserved                                                         */

  __IO uint32_t CFCR;            /*!< 0x200         Flash Pre-fetch Control Register                                 */
       uint32_t RESERVED4[63];   /*!< 0x204 ~ 0x2FF Reserved                                                         */

  __IO uint32_t SBVT[4];         /*!< 0x300 ~ 0x30C SRAM Booting Vector (4x32Bit)                                    */
} FLASH_TypeDef;


/**
 * @brief Clock Control Unit
 */
typedef struct
{
  __IO uint32_t GCFGR;           /*!< 0x000         Global Clock Configuration Register                              */
  __IO uint32_t GCCR;            /*!< 0x004         Global Clock Control Register                                    */
  __IO uint32_t GCSR;            /*!< 0x008         Global Clock Status Register                                     */
  __IO uint32_t GCIR;            /*!< 0x00C         Global Clock Interrupt Register                                  */
       uint32_t RESERVED0[2];    /*!< 0x010 ~ 0x17  Reserved                                                         */
  __IO uint32_t PLLCFGR;         /*!< 0x018         PLL Configuration Register                                       */
  __IO uint32_t PLLCR;           /*!< 0x01C         PLL Control Register                                             */
  __IO uint32_t AHBCFGR;         /*!< 0x020         AHB Configuration Register                                       */
  __IO uint32_t AHBCCR;          /*!< 0x024         AHB Clock Control Register                                       */
  __IO uint32_t APBCFGR;         /*!< 0x028         APB Configuration Register                                       */
  __IO uint32_t APBCCR0;         /*!< 0x02C         APB Clock Control Register 0                                     */
  __IO uint32_t APBCCR1;         /*!< 0x030         APB Clock Control Register 1                                     */
  __IO uint32_t CKST;            /*!< 0x034         Clock source status Register                                     */
       uint32_t RESERVED1[178];  /*!< 0x038 ~ 0x2FF Reserved                                                         */
  __IO uint32_t LPCR;            /*!< 0x300         Low Power Control Register                                       */
  __IO uint32_t MCUDBGCR;        /*!< 0x304         MCU Debug Control Register                                       */
} CKCU_TypeDef;


/**
 * @brief Reset Control Unit
 */
typedef struct
{
  __IO uint32_t GRSR;            /*!< 0x000         Global Reset Status Register                                     */
       uint32_t RESERVED1;       /*!< 0x004         Reserved                                                         */
  __IO uint32_t APBPRST0;        /*!< 0x008         APB Peripheral Reset Register 0                                  */
  __IO uint32_t APBPRST1;        /*!< 0x00C         APB Peripheral Reset Register 1                                  */
} RSTCU_TypeDef;


/**
  * @}
  */


/** @addtogroup Peripheral_Memory_Map
  * @{
  */

#define SRAM_BASE             ((u32)0x20000000)
#define SRAM_BB_BASE          ((u32)0x22000000)

#define PERIPH_BASE           ((u32)0x40000000)
#define PERIPH_BB_BASE        ((u32)0x42000000)

#define APB0PERIPH_BASE       PERIPH_BASE                   /* 0x40000000                                   */
#define APB1PERIPH_BASE       (PERIPH_BASE + 0x40000)       /* 0x40040000                                   */
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x80000)       /* 0x40080000                                   */

/* APB0                                                                                                     */
#define USART_BASE           (APB0PERIPH_BASE + 0x0000)     /* 0x40000000                                   */
#define SPI_BASE             (APB0PERIPH_BASE + 0x4000)     /* 0x40004000                                   */
#define ADC_BASE             (APB0PERIPH_BASE + 0x10000)    /* 0x40010000                                   */
#define CMP_OP0_BASE         (APB0PERIPH_BASE + 0x18000)    /* 0x40018000                                   */
#define CMP_OP1_BASE         (APB0PERIPH_BASE + 0x18100)    /* 0x40018100                                   */
#define GPIOA_BASE           (APB0PERIPH_BASE + 0x1A000)    /* 0x4001A000                                   */
#define GPIOB_BASE           (APB0PERIPH_BASE + 0x1B000)    /* 0x4001B000                                   */
#define AFIO_BASE            (APB0PERIPH_BASE + 0x22000)    /* 0x40022000                                   */
#define EXTI_BASE            (APB0PERIPH_BASE + 0x24000)    /* 0x40024000                                   */

/* APB1                                                                                                     */
#define I2C_BASE             (APB1PERIPH_BASE + 0x8000)     /* 0x40048000                                   */
#define WDT_BASE             (APB1PERIPH_BASE + 0x28000)    /* 0x40068000                                   */
#define RTC_BASE             (APB1PERIPH_BASE + 0x2A000)    /* 0x4006A000                                   */
#define PWRCU_BASE           (APB1PERIPH_BASE + 0x2A100)    /* 0x4006A100                                   */
#define GPTM0_BASE           (APB1PERIPH_BASE + 0x2E000)    /* 0x4006E000                                   */
#define GPTM1_BASE           (APB1PERIPH_BASE + 0x2F000)    /* 0x4006F000                                   */

/* AHB                                                                                                      */
#define FLASH_BASE           (AHBPERIPH_BASE + 0x0000)      /* 0x40080000                                   */
#define CKCU_BASE            (AHBPERIPH_BASE + 0x8000)      /* 0x40088000                                   */
#define RSTCU_BASE           (AHBPERIPH_BASE + 0x8100)      /* 0x40088100                                   */

/* Peripheral declaration                                                                                   */
/* Non Debug Mode                                                                                           */
#if (HT32F_LIB_DEBUG == 0)
  #define USART               ((USART_TypeDef *) USART_BASE)
  #define SPI                 ((SPI_TypeDef *) SPI_BASE)
  #define ADC                 ((ADC_TypeDef *) ADC_BASE)
  #define CMP_OP0             ((CMP_OP_TypeDef *) CMP_OP0_BASE)
  #define CMP_OP1             ((CMP_OP_TypeDef *) CMP_OP1_BASE)
  #define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
  #define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
  #define AFIO                ((AFIO_TypeDef *) AFIO_BASE)
  #define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
  #define I2C                 ((I2C_TypeDef *) I2C_BASE)
  #define WDT                 ((WDT_TypeDef *) WDT_BASE)
  #define RTC                 ((RTC_TypeDef *) RTC_BASE)
  #define PWRCU               ((PWRCU_TypeDef *) PWRCU_BASE)
  #define GPTM0               ((GPTM_TypeDef *) GPTM0_BASE)
  #define GPTM1               ((GPTM_TypeDef *) GPTM1_BASE)
  #define FLASH               ((FLASH_TypeDef *) FLASH_BASE)
  #define CKCU                ((CKCU_TypeDef *) CKCU_BASE)
  #define RSTCU               ((RSTCU_TypeDef *) RSTCU_BASE)

