coocox/cox/Holtek/HT32F125x/resource/holtek_coide_empty_project/cmsis_boot/ht32f125x.h
/* Debug Mode                                                                                               */
#else /* DEBUG ---------------------------------------------------------------------------------------------*/
  EXT USART_TypeDef            *USART;
  EXT SPI_TypeDef              *SPI;
  EXT ADC_TypeDef              *ADC;
  EXT CMP_OP_TypeDef           *CMP_OP0;
  EXT CMP_OP_TypeDef           *CMP_OP1;
  EXT GPIO_TypeDef             *GPIOA;
  EXT GPIO_TypeDef             *GPIOB;
  EXT AFIO_TypeDef             *AFIO;
  EXT EXTI_TypeDef             *EXTI;
  EXT I2C_TypeDef              *I2C;
  EXT WDT_TypeDef              *WDT;
  EXT RTC_TypeDef              *RTC;
  EXT PWRCU_TypeDef            *PWRCU;
  EXT GPTM_TypeDef             *GPTM0;
  EXT GPTM_TypeDef             *GPTM1;
  EXT FLASH_TypeDef            *FLASH;
  EXT CKCU_TypeDef             *CKCU;
  EXT RSTCU_TypeDef            *RSTCU;

#endif  /* DEBUG -------------------------------------------------------------------------------------------*/

#if (HT32F_LIB_DEBUG == 1)

/**
  * @brief  The assert_param macro is used for function's parameters check.
  * @param  expr: If expr is false, it calls assert_failed function
  *   which reports the name of the source file and the source
  *   line number of the call that failed.
  *   If expr is true, it returns no value.
  * @retval None
  */
#define Assert_Param(expr) ((expr) ? (void)0 : assert_error((u8 *)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- ------------------------------*/
void assert_error(u8* file, u32 line);

#else

#define Assert_Param(expr) ((void)0)

#endif /* DEBUG --------------------------------------------------------------------------------------------*/

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif  /* __HT32F125x_H__ */

/**
  * @}
  */

  /**
  * @}
  */

/******************* (C) COPYRIGHT 2010 Holtek Semiconductor Inc. *****END OF FILE****/
